posts/RASCUNHO-llms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RASCUNHO LLMs</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Programming, Tech, and occasional rant space by Lucas Vieira" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<link rel="alternate" type="application/atom+xml" title="The Alchemist's Hideout" href="/feed.xml" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/posts/RASCUNHO-llms.html">
<meta property="og:type" content="article">
<meta property="og:title" content="RASCUNHO LLMs">
<meta property="og:description" content="Programming, Tech, and occasional rant space by Lucas Vieira">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta property="article:author" content="Lucas S. Vieira">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/posts/RASCUNHO-llms.html">
<meta name="twitter:title" content="RASCUNHO LLMs">
<meta name="twitter:description" content="Programming, Tech, and occasional rant space by Lucas Vieira">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner-full.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">RASCUNHO LLMs</h1><p><i>Escrito em Fev 01, 2026 por Lucas S. Vieira</i></p>
</div>
<div id="content" class="content">
<p>
Desde o último texto que escrevi  referente a LLMs e inteligência artificial, em
que mostrei  como configurei meu ambiente  para lidar com essas  ferramentas, eu
acabei  mudando  muito  o  meu  ambiente e  inclusive  trocando  de  soluções  e
melhorando meus modelos locais. Ao  mesmo tempo, também fiz muitos experimentos,
tirei algumas conclusões, e estudei algumas coisas sobre o assunto para entender
melhor como tudo isso funciona.
</p>

<p>
Tem muitos aspectos técnicos nessa questão que  valem MUITO A PENA exporar, e eu
ainda  estou planejando  fazer  mais um  texto  sobre isso  ainda  nesse mês  de
fevereiro, mas  eu resolvi  deixar um pouco  para depois porque  eu vou  ter que
refazer alguns  pequenos experimentos e  também levantar algumas  informações de
forma mais correta.
</p>

<p>
Hoje eu quero discutir um pouco essas questões  de IA e LLM de um ponto de vista
um pouco filosófico,  e também conjecturar um  pouco a respeito do  que eu penso
que essas soluções  vão representar para nós no futuro.  Acredito que, depois de
passar de  totalmente cético e crítico  ao uso, ter experimentado,  e ter também
tido  uma abordagem  bem  técnica no  assunto, longe  dos  perigos noturnos  dos
marketeiros e dos "AI Bros", posso dar uma opinião educada sobre o assunto.
</p>
<div id="outline-container-org2d9d99e" class="outline-2">
<h2 id="org2d9d99e">A revolução das interfaces</h2>
<div class="outline-text-2" id="text-org2d9d99e">
<p>
Uma das coisas que acho mais importante no uso de <i>Large Language Models</i> (LLMs) é
a capacidade  que temos de  executá-las localmente.  Existe toda uma  questão de
privacidade e comodidade que vem com isso. e é justamente essa comodidade que me
atrai.
</p>

<p>
Há um  tempo vi de  relance algum  artigo ou reportagem  dizendo que tudo  o que
sabemos sobre  interfaces e  experiência do  usuário se  tornariam conhecimentos
obsoletos. A ideia era de que as interações com telas, botões e outros elementos
seriam puramente substituídas pela comunicação  em texto e linguagem natural das
IAs (LLMs e outras abstrações como agentes).
</p>

<p>
Obviamente isso é  balela. Não me oponho particularmente a  isso porque adoro um
terminal, uma interface textual, mas pensar  em substituição é algo extremo, até
porque precisamos  nos lembrar  de que  o próprio ambiente  visual em  que temos
acesso  a  essas IAs  também  deve  passar por  uma  revisão  de experiência  do
usuário. Do  contrário, aí  sim estaríamos  nos comunicando  com IAs  apenas via
console.
</p>

<p>
Ainda  que as  paredes de  texto das  IAs não  sejam substitutos  para elementos
visuais, cada vez mais empresas vêm integrando suas soluções com agentes capazes
de  realizarem  inferência e  responder  perguntas  baseadas nos  elementos  dos
produtos e  das soluções dessas  empresas. Por  exemplo, a Microsoft  colocou um
botão ou barra  do Copilot em absolutamente tudo  o que podia. E se  você for um
desenvolvedor usando  Visual Studio Code,  você já  deve ter percebido  uma nova
barra lateral que te ajude a operar agentes para fazer o que você quiser.
</p>

<p>
Essas barras auxiliares,  a meu ver, não são exatamente  muito intuitivas para o
usuário, porque vão na contramão da  intuitividade. Você será forçado a aprender
uma nova  nomenclatura antes de  conseguir utilizar tudo aquilo.  Poucas pessoas
sabem o que é  um agente, RAG, ou qualquer nomenclatura ligada a  IA. E cada dia
surge mais  vocabulário: skills, prompt  do sistema, prompt do  usuário&#x2026; Seria
inevitável que isso  acontecesse, mas fica evidente como quem  vai resolver esse
tipo de barreira vai ser a UX clássica, mesmo.
</p>

<p>
Tenho uma preferência  particular pela ideia das barras  de pesquisas integradas
com IA que já vi em certas  documentações, apesar de achar um grande defeito que
a pesquisa via IA seja geralmente  sugerida como primeira sugestão. Pesquisas em
bancos de dados DEMORAM, dependendo do cenário, então já vi sugestões diretas de
enviar um prompt para  uma IA em vez de esperar o retorno  do resultado. Se você
tiver automatizado  a ideia de digitar  uma pesquisa e dar  enter, esperando uma
tela  de carregamento&#x2026;  já era.  A  pesquisa é  abortada e  abre-se uma  barra
lateral com IA (estou olhando para vocês, documentação do Agno Framework!).
</p>

<p>
Aliás, acho que vale a pena até  apontar para o lado interessante dessa história
de documentação  apoiada por IA: trata-se  TAMBÉM de um tipo  de pesquisa, porém
com o  risco do não-determinismo e  das informações erradas, que  convenhamos, é
elevado. Mas inconsistências  à parte, pesquisar através da IA  só me faz pensar
que <b>as IAs são basicamente nossos novos controles-remoto</b>.
</p>
</div>
<div id="outline-container-org74f7b2a" class="outline-3">
<h3 id="org74f7b2a">Controles-remotos</h3>
<div class="outline-text-3" id="text-org74f7b2a">
<p>
Talvez isso pareça uma analogia estranha ou precipitada, mas vou explicar.
</p>

<p>
Para  que serve  um  controle-remoto  de televisão?  Bem,  olhando  aqui para  o
controle da minha  Smart TV, eu tenho  algumas teclas de todos  os tipos. Teclas
para aumentar ou diminuir o volume. Teclas para trocar o canal (algo que hoje já
não uso mais,  pois não assisto mais  TV). Teclas para deixar o  volume no mudo,
para desligar  a TV&#x2026; e temos  também teclas de  navegação que têm um  uso mais
abstrato, porque suas funcionalidades variam dependendo do contexto, ou seja, do
aplicativo que estiver sendo manipulado.
</p>

<p>
Meu controle de Smart  TV tem também outras operações mais  abstratas e até mais
comerciais. Por exemplo, botões de pelo menos quatro serviços de <i>streaming</i>. Digo
que são operações mais abstratas porque o  processo de abrir um aplicativo de um
serviço de <i>streaming</i> não necessariamente demanda  um contexto prévio do que você
estava   assistindo,  apenas   demanda  que   a  TV   mude  para   o  aplicativo
requisitado. Isso  requer muitas  nuances do  sistema operacional  da televisão,
porque "trocar um app  por outro" tem todo um significado  dentro do Android TV:
existem  coisas  chamadas   <i>intents</i>  e  outras  questões  nas   quais  nunca  me
aprofundei. Mesmo  assim, são formas  abstratas de  um serviço referenciar  e se
comunicar com outro aplicativo.
</p>

<p>
O  que quero  dizer com  tudo isso  é  que existe  um mecanismo  de operação  <i>da
interface</i>  para essas  funcionalidades, sejam  elas mais  ou menos  abstratas. A
semiótica do processo  deixa bem claro para o usuário  o que cada funcionalidade
faz. Cada função  separada pode ser diretamente ativada, e  o meio para ativação
de cada função  é o usuário saber  exatamente o que quer fazer,  e então decidir
qual botão apertar. Dizendo assim soa óbvio, mas veja o quanto o controle-remoto
demanda que  o usuário tenha  conhecimento de  símbolos, ícones, e  também tenha
automatizado o  que ele quer fazer.  Será que alguém mais  idoso, acostumado com
televisões cujos botões sejam aqueles de  girar, vão saber manipular um controle
com teclas "+" e "-" e um texto "Vol." entre elas?
</p>
</div>
</div>
<div id="outline-container-org387fb6f" class="outline-3">
<h3 id="org387fb6f">Interfaces na programação</h3>
</div>

<div id="outline-container-orgbb63bd2" class="outline-3">
<h3 id="orgbb63bd2">Interfaces na orientação a objetos de Alan Kay</h3>
</div>
</div>
<div id="outline-container-org369e352" class="outline-2">
<h2 id="org369e352">LLMs como interfaces de linguagem natural</h2>
<div class="outline-text-2" id="text-org369e352">
</div>
</div>
<div id="outline-container-org088694b" class="outline-2">
<h2 id="org088694b">Pontos de evolução</h2>
<div class="outline-text-2" id="text-org088694b">
</div>
</div>
<div id="outline-container-org66af61a" class="outline-2">
<h2 id="org66af61a">Prospectos</h2>
<div class="outline-text-2" id="text-org66af61a">
</div>
</div>
</div>
<div id="postamble" class="status">
<h3><a href="/pages/blog.html">&#8592; Voltar ao Blog</a></h3><p style="font-size: 0.85em; color: #888; margin-top: 1em; padding: 0.5em; border-left: 3px solid #555;">Os comentários foram desativados em razão da <a href="https://www.planalto.gov.br/ccivil_03/_ato2023-2026/2025/lei/L15211.htm" style="color: #888; text-decoration: underline;">Lei 15.211/2025</a> (ECA Digital, "Lei Felca"). A legislação impõe exigências de moderação que inviabilizam recursos interativos em sites pessoais sem estrutura para tanto.</p>
</div>
</body>
</html>
